---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleView.GetTemplate
source: html/0150a58d-4d48-6552-384f-d5faa08d08e0.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleView.GetTemplate Method

Gets the template for this view (to set the template, you must go through generateInstanceFromTemplate)

## Syntax (C#)
```csharp
public ElementId GetTemplate()
```

## Returns
The template id for this view